Autodesk.Revit.UI.ExternalEvent.IsPending
Checking whether an event has been raised but not yet executed.
Remarks:
When en event is requested to raise it is not executed immediatelly;
instead, it waits for the next possible opportunity, which is determined
by various internal conditions in Revit (policy similar to invoking
external commands). When the opportunity comes, the event is executed
by calling the event's handler. In the meantime, the event is 'Pending'.
Since:
2013